using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BL
{
    public class SingerSearchingToUserBL
    {
        //1. פונקציה שמחזירה את כל החיפושים של כל המשתמשים - כלומר - כל הטבלה

        //2. פונקציה שמחזירה את כל החיפושים של משתמש מסוים - מקבלת מזהה משתמש
        
        //3. פונקציה פרטית שמוסיפה
        //   משתמש שלא מופיע בטבלה או שהזמר שחיפש לא מופיע לו בחיפושים

        //4. פונקציה פרטית שמוסיפה אחד לכמות החיפושים
        //   של משתמש לחיפוש של זמר מסוים - מקבלת מזהי משתמש וזמר

        //5. פונקציה שבודקת אם המשתמש קיים בטבלה וגם יש לו חיפוש לזמר הרצוי ואם כן שולחת
        //   לפונקציה הרביעית אחרת לפונקציה השלישית - מקבלת מזהי משתמש וזמר

        // הערות -
        // 1. בקונטרולר תהיה פונקציית הוספה שתקרא לפונקציה החמישית
        //    והיא תשלח לפונקציה השלישית / הרביעית בהתאם לצורך
        // 2. בפונקציות השלישית והרביעית - של ההוספות - יש לעדכן גם את עמודת תאריך
    }
}
